def replace_numebrs_p5_7(str_p5_7):
    """
    Дана строка. Замените в этой строке все цифры 1 на слово one
    """
    str_p5_7 = str_p5_7.replace("1", "one")
    print(str_p5_7)

str_p5_7 = "1 of the another 1"
replace_numebrs_p5_7(str_p5_7)