"""
7. На входе функция to_set() получает строку или список чисел. Преобразуйте их в множество. На
выходе должно получиться множество и его мощность.
8. Предоставлен список натуральных чисел. Требуется сформировать из них множество. Если
какое-либо число повторяется, то преобразовать его в строку по образцу: например, если число
4 повторяется 3 раза, то в множестве будет следующая запись: само число 4, строка 44 (второе
повторение, т.е. число дублируется в строке), строка 444 (третье повторение, т.е. строка
множится на 3). Реализуйте вывод множества через функцию set_gen().
9. Напишите функцию, которая получает на вход две строки с перечислением интересов и хобби
двух пользователей, и вычисляет процент совпадения. Использовать множества.
"""